Invalid connections have been disconnected. Please reconnect them manually or use different fittings.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
 Syntax
  C#
public static FailureDefinitionId InvalidConnectionsHaveBeenDisconnected { get; }
  Visual Basic
Public Shared ReadOnly Property InvalidConnectionsHaveBeenDisconnected As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ InvalidConnectionsHaveBeenDisconnected {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures MEPFabricationFailures Class
  Autodesk.Revit.DB Namespace